5.Resources/Hall_Implementation_openFOAM/Z2flatlookuptable/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    sides1
    {
        type            zeroGradient;
    }
	
    sides2
    {
        type            zeroGradient;
    }
	
    wall1
    {
        type            cyclic;
    }
	
    wall2
    {
        type            cyclic;
    }

    outlet
    {
        type            fixedValue;
		value		    uniform 0;
	}
	
    inlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
